app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "shhhhhshshhshs"], ["body", "aaaaaaaaaaaaaaaaaaaaa"], ["post_id", 8], ["created_at", "2018-07-30 07:04:24.696875"], ["updated_at", "2018-07-30 07:04:24.696875"]]
---
    def create
        @post = Post.find(params[:post_id])
        p "comment_params"
        p comment_params
        @comment = @post.comments.create(comment_params)